Skriware/Skribrain-core/esp32/boards.txt
menu.UploadSpeed=Upload Speed
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM

##############################################################

Skribrain.name=Skribrain

Skribrain.vid.0=0x0403
Skribrain.pid.0=0x6015
Skribrain.upload.tool=esptool_py
Skribrain.upload.maximum_size=1310720
Skribrain.upload.maximum_data_size=294912
Skribrain.upload.wait_for_upload_port=true

Skribrain.serial.disableDTR=true
Skribrain.serial.disableRTS=true

Skribrain.build.mcu=esp32
Skribrain.build.core=esp32
Skribrain.build.variant=esp32
Skribrain.build.board=ESP32_DEV

Skribrain.build.f_cpu=240000000L
Skribrain.build.flash_size=4MB
Skribrain.build.flash_freq=40m
Skribrain.build.flash_mode=dio
Skribrain.build.boot=dio
Skribrain.build.partitions=default

Skribrain.menu.PartitionScheme.default=Default
Skribrain.menu.PartitionScheme.default.build.partitions=default
Skribrain.menu.PartitionScheme.minimal=Minimal (2MB FLASH)
Skribrain.menu.PartitionScheme.minimal.build.partitions=minimal
Skribrain.menu.PartitionScheme.no_ota=No OTA (Large APP)
Skribrain.menu.PartitionScheme.no_ota.build.partitions=no_ota
Skribrain.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Skribrain.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
Skribrain.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
Skribrain.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

Skribrain.menu.FlashMode.qio=QIO
Skribrain.menu.FlashMode.qio.build.flash_mode=dio
Skribrain.menu.FlashMode.qio.build.boot=qio
Skribrain.menu.FlashMode.dio=DIO
Skribrain.menu.FlashMode.dio.build.flash_mode=dio
Skribrain.menu.FlashMode.dio.build.boot=dio
Skribrain.menu.FlashMode.qout=QOUT
Skribrain.menu.FlashMode.qout.build.flash_mode=dout
Skribrain.menu.FlashMode.qout.build.boot=qout
Skribrain.menu.FlashMode.dout=DOUT
Skribrain.menu.FlashMode.dout.build.flash_mode=dout
Skribrain.menu.FlashMode.dout.build.boot=dout

Skribrain.menu.FlashFreq.80=80MHz
Skribrain.menu.FlashFreq.80.build.flash_freq=80m
Skribrain.menu.FlashFreq.40=40MHz
Skribrain.menu.FlashFreq.40.build.flash_freq=40m

Skribrain.menu.FlashSize.4M=4MB (32Mb)
Skribrain.menu.FlashSize.4M.build.flash_size=4MB
Skribrain.menu.FlashSize.2M=2MB (16Mb)
Skribrain.menu.FlashSize.2M.build.flash_size=2MB
Skribrain.menu.FlashSize.2M.build.partitions=minimal

Skribrain.menu.UploadSpeed.921600=921600
Skribrain.menu.UploadSpeed.921600.upload.speed=921600
Skribrain.menu.UploadSpeed.115200=115200
Skribrain.menu.UploadSpeed.115200.upload.speed=115200
Skribrain.menu.UploadSpeed.256000.windows=256000
Skribrain.menu.UploadSpeed.256000.upload.speed=256000
Skribrain.menu.UploadSpeed.230400.windows.upload.speed=256000
Skribrain.menu.UploadSpeed.230400=230400
Skribrain.menu.UploadSpeed.230400.upload.speed=230400
Skribrain.menu.UploadSpeed.460800.linux=460800
Skribrain.menu.UploadSpeed.460800.macosx=460800
Skribrain.menu.UploadSpeed.460800.upload.speed=460800
Skribrain.menu.UploadSpeed.512000.windows=512000
Skribrain.menu.UploadSpeed.512000.upload.speed=512000

Skribrain.menu.DebugLevel.none=None
Skribrain.menu.DebugLevel.none.build.code_debug=0
Skribrain.menu.DebugLevel.error=Error
Skribrain.menu.DebugLevel.error.build.code_debug=1
Skribrain.menu.DebugLevel.warn=Warn
Skribrain.menu.DebugLevel.warn.build.code_debug=2
Skribrain.menu.DebugLevel.info=Info
Skribrain.menu.DebugLevel.info.build.code_debug=3
Skribrain.menu.DebugLevel.debug=Debug
Skribrain.menu.DebugLevel.debug.build.code_debug=4
Skribrain.menu.DebugLevel.verbose=Verbose
Skribrain.menu.DebugLevel.verbose.build.code_debug=5


